## Name of the practical: Data Wrangling I
<br><br>
**Perform the following operations using Python on any open source dataset (e.g., data.csv)**
1. Import all the required Python Libraries.
2. Locate open source data from the web (e.g., https://www.kaggle.com). Provide a clear
description of the data and its source (i.e., URL of the web site).
3. Load the Dataset into pandas dataframe.
4. Data Preprocessing: check for missing values in the data using pandas isnull(), describe()
function to get some initial statistics. Provide variable descriptions. Types of variables etc.
Check the dimensions of the data frame.
5. Data Formatting and Data Normalization: Summarize the types of variables by checking the
data types (i.e., character, numeric, integer, factor, and logical) of the variables in the data set.
If variables are not in the correct data type, apply proper type conversions.
6. Turn categorical variables into quantitative variables in Python.
In addition to the codes and outputs, explain every operation that you do in the above steps and explain
everything that you do to import/read/scrape the data set.

## 1. Import all the required Python Libraries.

In [67]:
import pandas as pd

## 2. Locate open source data from the web (e.g., https://www.kaggle.com). Provide a clear description of the data and its source (i.e., URL of the web site).

## 3. Load the Dataset into pandas dataframe.

In [68]:
stud = pd.read_csv('../Datasets/student.csv')
stud.head()

   Roll No    Name Gender  Sem1  Sem2  Sem3  Sem4  average Score
0        1  Aditya      M  75.0  10.0  78.0  95.0           64.5
1        2   Priti      F  78.0  76.0  78.0  76.0           77.0
2        3   Arjun      M   7.0  95.0  98.0  90.0           72.5
3        4   Bheem      M  88.0  68.0  78.0  80.0           78.5
4        5    Raju      M  25.0  69.0   NaN  70.0           41.0

## 4. Data Preprocessing: check for missing values in the data using pandas isnull(), describe() function to get some initial statistics. Provide variable descriptions. Types of variables etc. Check the dimensions of the data frame.

In [69]:
# checking for missing values
stud.isnull().sum()

Roll No          0
Name             0
Gender           0
Sem1             2
Sem2             2
Sem3             2
Sem4             3
average Score    0
dtype: int64

In [70]:
# initial statistics
stud.describe()

,Roll No,Sem1,Sem2,Sem3,Sem4,average Score
count,30.000000,28.000000,28.000000,28.000000,27.000000,30.000000
mean,15.500000,70.392857,76.214286,78.285714,77.296296,75.119445
std,8.803408,81.065287,59.355400,84.232420,105.490362,45.505424
min,1.000000,3.000000,10.000000,-8.000000,2.000000,20.500000
25%,8.250000,37.250000,58.500000,49.500000,43.500000,52.125000
50%,15.500000,56.500000,68.500000,75.000000,68.000000,59.875000
75%,22.750000,80.250000,84.000000,84.500000,83.000000,76.000000
max,30.000000,459.000000,356.000000,485.000000,586.000000,236.666667

In [71]:
# checking data types
stud.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Roll No        30 non-null     int64
 1   Name           30 non-null     object
 2   Gender         30 non-null     object
 3   Sem1           28 non-null     float64
 4   Sem2           28 non-null     float64
 5   Sem3           28 non-null     float64
 6   Sem4           27 non-null     float64
 7   average Score  30 non-null     float64
dtypes: float64(5), int64(1), object(2)
memory usage: 2.0+ KB

In [72]:
# checking data types
stud.dtypes

Roll No            int64
Name              object
Gender            object
Sem1             float64
Sem2             float64
Sem3             float64
Sem4             float64
average Score    float64
dtype: object

In [73]:
# checking dimensions
stud.shape

(30, 8)

## 5. Data Formatting and Data Normalization: Summarize the types of variables by checking the data types (i.e., character, numeric, integer, factor, and logical) of the variables in the data set. If variables are not in the correct data type, apply proper type conversions.

In [74]:
stud.dropna(inplace=True)

In [75]:
stud[['Sem1','Sem2','Sem3','Sem4']]=stud[['Sem1','Sem2','Sem3','Sem4']].astype('int64')

In [76]:
stud.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21 entries, 0 to 28
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Roll No        21 non-null     int64
 1   Name           21 non-null     object
 2   Gender         21 non-null     object
 3   Sem1           21 non-null     int64
 4   Sem2           21 non-null     int64
 5   Sem3           21 non-null     int64
 6   Sem4           21 non-null     int64
 7   average Score  21 non-null     float64
dtypes: float64(1), int64(5), object(2)
memory usage: 1.5+ KB

## 6. Turn categorical variables into quantitative variables in Python. In addition to the codes and outputs, explain every operation that you do in the above steps and explain everything that you do to import/read/scrape the data set.

In [77]:
stud.head(2)

   Roll No    Name Gender  Sem1  Sem2  Sem3  Sem4  average Score
0        1  Aditya      M    75    10    78    95           64.5
1        2   Priti      F    78    76    78    76           77.0

In [78]:
stud['Gender'] = stud['Gender'].map({'M':0,'F':1})

In [79]:
stud.head(2)

   Roll No    Name  Gender  Sem1  Sem2  Sem3  Sem4  average Score
0        1  Aditya       0    75    10    78    95           64.5
1        2   Priti       1    78    76    78    76           77.0